services/ecom-backend/README.md
```mermaid
erDiagram
    product_hierarchy {
        integer id PK
        integer category_id
        integer subcategory_id
        varchar category_name
        varchar subcategory_name
        varchar category_slug
        varchar subcategory_slug
    }

    product {
        integer id PK
        integer category_id
        integer subcategory_id
        varchar name
        varchar slug
        varchar description
        float   price
        timestamp created_at
    }

    user {
        integer   id PK
        varchar   first_name
        varchar   last_name
        varchar   role
        timestamp created_at
    }

    cart {
        integer   id PK
        integer   user_id
        float     amount
        timestamp created_at
    }

    cart_item {
        integer id PK
        integer cart_id
        integer product_id
        float   quantity
        float   amount
    }

    product_hierarchy ||--o{ product : "category_id + subcategory_id"
    user ||--o{ cart : "user_id"
    cart ||--o{ cart_item : "cart_id"
    product ||--o{ cart_item : "product_id"
```
